void main() {
  String a = 'Bvc, skdgk, dkdbak';
  // final aa = a.replaceAll(' ', '+');

  print(a);
  // endsWith('d')
// replaceAll(' ', '-')
  // toString() bul Srting kaitarat
  // trim() сапты алдынкы жана арткы боштуксуз кайтарат
// toLowerCase() символдорду кичине тамга менен
// toUpperCase());// символдорду чон тамга менен
  // int s = 22;
  // print(s.toString());
  // bool g = true;
  // g = false;
  // const double dd = 2.3;

  // dynamic sd = 0.2;
  // sd = 12;

  // Set<dynamic> b = {12, 333, 22, 234, 'asd'};
  // Set<dynamic> a = {12, 333, 2, 23, 'qa'};
  // List<dynamic> e = ['alma', 'banan', 'juzum'];
  // List<dynamic> r = ['alma', 'banan', 'juzum'];

  // a.addAll(b);
  // // a.clear();
  // a.add(221);
  // print(a);
  // e.addAll(r);

  // print(e);
//   int a = 13;
//   int q = 1110000000000; //""
//   String e = '''С 2011 года членами ООН являются 193 страны — почти все
// суверенные государства мира. В структуру ООН входят шесть основных
// органов: Генеральная Ассамблея, Совет Безопасности, Экономический и Социальный Совет (ЭКОСОС), Совет по опеке, Международный суд ООН и Секретариат ООН. В рамках более широкой системы ООН работает ряд специализированных международных агентств, фондов и программ, в том числе Группа Всемирного банка, Всемирная организация здравоохранения, Всемирная продовольственная программа, ЮНЕСКО и ЮНИСЕФ. Главным административным
// должностным лицом ООН является Генеральный секретарь
// ООН; с 2017 года этот пост занимает португальский''';
//   // String e =
//   //     'С 2011 года членами ООН являются 193 страны — почти все суверенные государства мира. В структуру ООН входят шесть основных органов: Генеральная Ассамблея, Совет Безопасности, Экономический и Социальный Совет (ЭКОСОС), Совет по опеке, Международный суд ООН и Секретариат ООН. В рамках более широкой системы ООН работает ряд специализированных международных агентств, фондов и программ, в том числе Группа Всемирного банка, Всемирная организация здравоохранения, Всемирная продовольственная программа, ЮНЕСКО и ЮНИСЕФ. Главным административным должностным лицом ООН является Генеральный секретарь ООН; с 2017 года этот пост занимает португальский';
//   // String b =
//   //     "'С 2011 года членами ООН являются 193 страны — \nпочти все суверенные государства мира. В структуру ООН входят шесть основных органов: Генеральная Ассамблея, Совет Безопасности, Экономический и Социальный Совет (ЭКОСОС), Совет по опеке, Международный суд ООН и Секретариат ООН. В рамках более широкой системы ООН работает ряд специализированных международных агентств, фондов и программ, в том числе Группа Всемирного банка, Всемирная организация здравоохранения, Всемирная продовольственная программа, ЮНЕСКО и ЮНИСЕФ. Главным административным должностным лицом ООН является Генеральный секретарь ООН; с 2017 года этот пост занимает португальский'";
//   double w = 22.3;
  // int s = a + e.toInt();
  // print(a);
  // // print(e);
  // // print(b);
  // print(e + a.toString());
  //////////////////////////////////////////////////////////////////////////////////
  // // Генерируем случайное целое число
  // int randomInt = Random().nextInt(100); // Генерирует число от 0 до 99
  // print('Случайное целое число: $randomInt');

  // // Генерируем случайное число с плавающей точкой
  // double randomDouble =
  //     Random().nextDouble(); // Генерирует число между 0.0 и 1.0
  // print('Случайное число с плавающей точкой: $randomDouble');
//////////////////////////////////////////////////////////////////////////////////////////
  // int day = 10;
  // if (day == 1 || day == 2 || day == 3 || day == 4 || day == 5) {
  //   print('Жумуш күн');
  // } else if (day > 3) {
  //   print(
  //       'Сиз жумада 7 күн бар экенин билесиз. Программа менен ойной бербеңиз.');
  // } else {
  //   print('Эс алуу күн');
  // }
  // var rng = Random();
  // for (var i = 0; i < 10; i++) {
  //   print(rng.nextInt(100));
  // }
  // var i = 0;
  // while (i < 10) {
  //   print(i);
  //   i = i + 2;
  // }

  //////////////////////////////////////////////////////

  // int b = a.length;

  // for (int i = 0; i < b; i++) {
  //   print(b);
  // }
///////////////////////////////////////////////////////////////
  // List a = [12, 'ddd', true, 33];

  // a.addAll(b);
  // print(a[0]);
  // print(b);
  // print(a);
  // // a.add(10);
  // a.clear();
  // print(a);
  // print(a.length);
  // print(a.contains(1));

  // List<dynamic> list = List.filled(6, 0);
  // list[0] = 4;
  // list[1] = 'dfg';
  // list[3] = true;
  // list[4] = false;
  // list[5] = true;

  // print(list);
  // Map map = {22: 552, 'dfgh': 55, true: 'sdfg'};
  // Map map2 = {2: 55, 'dfg': 50, false: 'ikm,'};

  // map.addAll(map2);
  // map.clear();

  // print(map.length);
  ///////////////////////////////////////////////////
  //  == равно
  // != не равно
  // <= Меньше или равно
  // >= Больше или равно
  // >  Больше
  // < Меньше

// && (и)
// || (или)

  // int balans = 101;
  // int avtobuws = 40;
  // int taxsi = 100;
  // int biznes = 500;

  // if (balans >= avtobuws && balans <= taxsi) {
  //   print('avtobus menen ketem');
  // } else if (balans >= taxsi && balans <= biznes) {
  //   print('taxsi menen ketem');
  // } else if (balans >= biznes) {
  //   print('biznes menen ketem');
  // } else {
  //   print('peshkom ketem');
  // }

  // int balans = 0;
  // int avtobuws = 40;
  // int taxsi = 100;
  // int biznes = 500;

  // if (balans >= avtobuws && balans <= taxsi) {
  //   return print('avtobus menen ketem');
  // } else if (balans >= taxsi && balans < biznes) {
  //   return print('taxsi menen ketem');
  // }
  /////////////////////////////////////////////////////////////////////

// String almaBak = '22'; // camel case:
//   String alma_bak_12 = "a'sdfgd   "; //snak case:
//   String alma_bak_ = '''ASDFGH
// // SDFGHJK'''; //sn
// // int c = 23;
//   int b = 13;
// // print(c % a);

// // print(almaBak);
//   // print(alma_bak_12 + '   Sasdfgh  ' + alma_bak_);
// // print(alma_bak_);

//   bool ss = a >= b;
//   print(ss);
////////////////////////////////////////////////////////////////////
}
